Repository: KaNa098w/bolshek_satu
Catalog: bolshek_pro/lib/l10n/intl_*.arb
Languages: ar, kk, zh

# file_size_exceed
source: File size still exceeds 15 MB after compression
ar: حجم الملف بعد الضغط لا يزال يتجاوز 15 ميجابايت
kk: Сығылған файл өлшемі әлі 15 МБ-тан асады
zh: 压缩后文件大小仍超过15MB

# max_images_exceeded
source: Maximum 5 photos allowed
ar: الحد الأقصى للصور هو 5
kk: Ең көп 5 фото жүктеуге болады
zh: 最多允许上传5张照片

source: Error selecting image
ar: حدث خطأ أثناء اختيار الصورة
kk: Суретті таңдауда қате
zh: 选择图片时出错

source: Error processing file
ar: خطأ في معالجة الملف
kk: Файл өңдеу қатесі
zh: 文件处理错误

source: Camera
ar: كاميرا
kk: Камера
zh: 相机

source: Gallery
ar: المعرض
kk: Галерея
zh: 相册

source: Add Product
ar: إضافة منتج
kk: Өнімді қосу
zh: 添加产品

# info_tab
source: Info
ar: معلومات
kk: Ақпарат
zh: 信息

# fill_required_info
source: Please fill in all required fields on the Info tab
ar: يرجى ملء جميع الحقول المطلوبة في تبويب المعلومات
kk: Ақпарат қойындысындағы барлық міндетті өрістерді толтырыңыз
zh: 请在“信息”选项卡中填写所有必填字段

source: Error loading properties
ar: خطأ في تحميل الخصائص
kk: Сипаттамаларды жүктеу қатесі
zh: 加载属性时出错

# fill_all_fields
source: Fill in all fields
ar: يرجى ملء جميع الحقول
kk: Барлық өрістерді толтырыңыз
zh: 填写所有字段

source: Initialization
ar: التهيئة
kk: Инициализация
zh: 初始化

source: Creating product
ar: جاري إنشاء المنتج
kk: Өнім жасалуда
zh: 创建产品

# product_id_not_found
source: Product ID not found in response
ar: لم يتم العثور على معرف المنتج في الاستجابة
kk: Өнімнің ID жауабында табылмады
zh: 响应中未找到产品ID

source: Product created
ar: تم إنشاء المنتج
kk: Өнім жасалды
zh: 产品已创建

source: Uploading photos
ar: جارٍ تحميل الصور
kk: Фотосуреттер жүктелуде
zh: 上传照片

source: Photos uploaded
ar: تم تحميل الصور
kk: Фотосуреттер жүктелді
zh: 照片已上传

# creating_variant
source: Creating product variant
ar: إنشاء إصدار للمنتج
kk: Өнім нұсқасын жасау
zh: 创建产品变体

# variant_created
source: Product variant created
ar: تم إنشاء إصدار المنتج
kk: Өнім нұсқасы жасалды
zh: 产品变体已创建

source: Creating tags
ar: إنشاء الوسوم
kk: Тегтерді жасау
zh: 创建标签

source: Tags saved
ar: تم حفظ الوسوم
kk: Тегтер сақталды
zh: 标签已保存

# tags_empty
source: Tag list is empty
ar: قائمة الوسوم فارغة
kk: Тегтер тізімі бос
zh: 标签列表为空

source: Saving properties
ar: جارٍ حفظ الخصائص
kk: Сипаттамаларды сақтау
zh: 保存属性

source: Properties saved
ar: تم حفظ الخصائص
kk: Сипаттамалар сақталды
zh: 属性已保存

# product_created_successfully
source: Product successfully created!
ar: تم إنشاء المنتج بنجاح!
kk: Өнім сәтті жасалды!
zh: 产品创建成功！

source: Go to products
ar: اذهب إلى المنتجات
kk: Өнімдерге өту
zh: 前往产品

source: Enter number
ar: أدخل الرقم
kk: Санды енгізіңіз
zh: 输入数字

source: Choose color
ar: اختر اللون
kk: Түсті таңдаңыз
zh: 选择颜色

source: Create product
ar: إنشاء منتج
kk: Өнім жасау
zh: 创建产品

source: Variant
ar: النسخة
kk: Нұсқа
zh: 变体

source: Choose type
ar: اختر النوع
kk: Типті таңдаңыз
zh: 请选择类型

source: Delivery methods
ar: طرق التوصيل
kk: Жеткізу әдістері
zh: 配送方式

source: Choose delivery method
ar: اختر طريقة التوصيل
kk: Жеткізу әдісін таңдаңыз
zh: 请选择配送方式

source: Express
ar: سريع
kk: Экспресс
zh: 特快

source: Standard
ar: قياسي
kk: Стандартты
zh: 标准

# custom_delivery
source: Custom
ar: مخصص
kk: Арнайы
zh: 定制

source: Choose manufacturer
ar: اختر المُصنّع
kk: Өндірушіні таңдаңыз
zh: 请选择制造商

source: Tags
ar: العلامات
kk: Тегтер
zh: 标签

source: Choose tags
ar: اختر العلامات
kk: Тегтерді таңдаңыз
zh: 请选择标签

source: Vendor Code
ar: رمز المنتج
kk: Өнім коды
zh: 货号

# manufacturer_search
source: Search manufacturer
ar: بحث المُصنّع
kk: Өндірушіні іздеу
zh: 搜索制造商

source: Add manufacturer
ar: إضافة المُصنّع
kk: Өндіруші қосу
zh: 添加制造商

source: Manufacturer name
ar: اسم المُصنّع
kk: Өндірушінің атауы
zh: 制造商名称

# enter_manufacturer_name
source: Enter name
ar: أدخل الاسم
kk: Атауды енгізіңіз
zh: 请输入名称

source: Vehicle compatibility
ar: توافق المركبة
kk: Көлікке сәйкестігі
zh: 车辆兼容性

# choose_vehicle
source: Choose suitable brands
ar: اختر العلامات التجارية المناسبة
kk: Сәйкес брендтерді таңдаңыз
zh: 选择合适的品牌

source: Properties not found
ar: لم يتم العثور على الخصائص
kk: Сипаттамалар табылмады
zh: 未找到属性

source: Error fetching data
ar: خطأ في جلب البيانات
kk: Деректерді алуда қате
zh: 获取数据出错

# errorFetchingAlternatives
source: Error fetching alternative numbers
ar: خطأ في جلب الأرقام البديلة
kk: Балама нөмірлерді алуда қате
zh: 获取替代号码出错

source: Choose appropriate brands
ar: اختر العلامات التجارية المناسبة
kk: Сәйкес брендтерді таңдаңыз
zh: 选择合适的品牌

source: Enter OEM number
ar: أدخل رقم OEM
kk: OEM нөмірін енгізіңіз
zh: 输入OEM号码

source: Alternative OEM numbers
ar: أرقام OEM البديلة
kk: Балама OEM нөмірлері
zh: 替代OEM号码

source: Vehicle mapping
ar: تطابق المركبة
kk: Көлік сәйкестігі
zh: 车辆匹配

source: Primary OEM number
ar: رقم OEM الأساسي
kk: Басты OEM нөмірі
zh: 主要OEM号码

source: OEM number
ar: رقم OEM
kk: OEM нөмірі
zh: OEM号码

source: Add another mapping
ar: أضف تطابقًا آخر
kk: Тағы бір сәйкестік қосу
zh: 添加另一个匹配

source: Car brand
ar: علامة السيارات
kk: Көлік бренді
zh: 汽车品牌

source: Search by brand
ar: البحث حسب العلامة
kk: Бренд бойынша іздеу
zh: 按品牌搜索

source: Search by model
ar: البحث حسب الموديل
kk: Модель бойынша іздеу
zh: 按车型搜索

source: Success!
ar: نجاح!
kk: Сәтті!
zh: 成功！

# productCreated
source: Product successfully created
ar: تم إنشاء المنتج بنجاح
kk: Өнім сәтті жасалды
zh: 产品创建成功

source: Failed to open link:
ar: فشل فتح الرابط:
kk: Сілтемені ашу сәтсіз өтті:
zh: 无法打开链接：

source: Product photos
ar: صور المنتج
kk: Өнім фотолары
zh: 产品照片

source: No image
ar: لا توجد صورة
kk: Сурет жоқ
zh: 无图像

# viewProduct
source: View product on bolshek.kz
ar: عرض المنتج على bolshek.kz
kk: bolshek.kz сайтында өнімді қараңыз
zh: 在 bolshek.kz 查看产品

source: Product name
ar: اسم المنتج
kk: Өнімнің атауы
zh: 产品名称

source: Not specified
ar: غير محدد
kk: Көрсетілмеген
zh: 未指定

source: Enter price
ar: أدخل السعر
kk: Бағаны енгізіңіз
zh: 输入价格

source: Create product
ar: إنشاء المنتج
kk: Өнімді жасау
zh: 创建产品

# editOnlyAfterProductCreated
source: Editing is available only after the product is created
ar: التعديل متاح فقط بعد إنشاء المنتج
kk: Өнім жасалғаннан кейін ғана өзгерту мүмкін
zh: 只有在创建产品之后才能进行更改

# productOutOfStock
source: Product is out of stock
ar: المنتج غير متوفر
kk: Өнім қолжетімсіз
zh: 商品缺货

# orderCreated
source: New order received
ar: تم استلام طلب جديد
kk: Жаңа тапсырыс келді
zh: 收到新订单

source: Order delivered
ar: تم تسليم الطلب
kk: Тапсырыс жеткізілді
zh: 订单已送达

source: Order canceled
ar: تم إلغاء الطلب
kk: Тапсырыс тоқтатылды
zh: 订单已取消

source: Order refunded
ar: تم إرجاع الطلب
kk: Тапсырыс қайтарылды
zh: 订单已退还

source: Order received date:
ar: تاريخ استلام الطلب:
kk: Тапсырыс алынған күні:
zh: 订单接收日期:

source: Notification not opened
ar: لم يتم فتح الإشعار
kk: Хабарлама ашылмаған
zh: 通知未打开

source: Notifications
ar: الإشعارات
kk: Хабарламалар
zh: 通知

source: No notifications
ar: لا توجد إشعارات
kk: Хабарлама жоқ
zh: 没有通知

source: Choose address
ar: اختر العنوان
kk: Мекенжайды таңдаңыз
zh: 选择地址

source: Address not selected
ar: العنوان غير محدد
kk: Мекенжай таңдалған емес
zh: 地址未选择

source: Current address:
ar: العنوان الحالي:
kk: Ағымдағы мекенжай:
zh: 当前地址：

source: Select address
ar: اختر العنوان
kk: Мекенжайды таңдау
zh: 选择地址

source: Failed to get address
ar: فشل في الحصول على العنوان
kk: Мекенжайды алу сәтсіз аяқталды
zh: 获取地址失败

# failedToGetAddressNetwork
source: Failed to get address (Network error)
ar: فشل في الحصول على العنوان (خطأ بالشبكة)
kk: Мекенжайды алу сәтсіз аяқталды (Желі қатесі)
zh: 获取地址失败（网络错误）

source: Location service disabled
ar: خدمة الموقع معطلة
kk: Локация қызметі өшірілген
zh: 定位服务已关闭

source: Location permission denied
ar: تم رفض إذن الموقع
kk: Локацияға рұқсат берілмеген
zh: 未获得定位权限

source: Failed to get coordinates
ar: فشل في الحصول على الإحداثيات
kk: Координаттарды алу сәтсіз аяқталды
zh: 获取坐标失败

# locationError
source: Error obtaining location
ar: خطأ في الحصول على الموقع
kk: Орналасуды алу қатесі
zh: 获取位置错误

# empty
source: Empty list
ar: القائمة فارغة
kk: Тізім бос
zh: 列表为空

source: Product tags:
kk: Өнім тегтері:
zh: 产品标签：

source: Available tags:
kk: Қол жетімді тегтер:
zh: 可用标签：

# productUpdatedSuccessfully
source: Product successfully updated
kk: Өнім сәтті жаңартылды
zh: 产品已成功更新

source: Show product
kk: Өнімді көрсету
zh: 显示产品

source: Product editing
kk: Өнімді өңдеу
zh: 产品编辑

source: Repeat
kk: Қайталау
zh: 重试

source: Product status
kk: Өнімнің статусы
zh: 产品状态

source: Awaiting moderation
kk: Модерацияны күтуде
zh: 等待审核

source: Type
kk: Түр
zh: 类型

source: Product property:
kk: Өнім қасиеті:
zh: 产品属性：

source: No available properties
kk: Қолжетімді қасиеттер жоқ
zh: 没有可用属性

source: Update product
kk: Өнімді жаңарту
zh: 更新产品

# updateProductLoading
source: Product update...
ar: تحديث المنتج...
kk: Өнім жаңартылуда...
zh: 产品更新...

source: Enter OEM number
ar: أدخل رقم OEM
kk: OEM нөмірін енгізіңіз
zh: 输入OEM编号

source: Alternative OEM numbers:
ar: أرقام OEM البديلة:
kk: Баламалы OEM нөмірлері:
zh: 替代OEM编号：

source: Primary OEM number
ar: الرقم الأساسي لـ OEM
kk: Негізгі OEM нөмірі
zh: 主要OEM编号

source: OEM number
ar: رقم OEM
kk: OEM нөмірі
zh: OEM编号

source: Return composition
ar: محتويات الإرجاع
kk: Қайтару құрамы
zh: 退货组成

source: Return details
ar: تفاصيل الإرجاع
kk: Қайтару мәліметтері
zh: 退货详情

source: Date
ar: التاريخ
kk: Күні
zh: 日期

source: Comment
ar: تعليق
kk: Пікір
zh: 评论

source: Reason
ar: السبب
kk: Себебі
zh: 原因

# reason_bad_quality
source: Poor quality product
ar: منتج ذو جودة رديئة
kk: Сапасыз өнім
zh: 产品质量差

# reason_damaged
source: Product or packaging damaged
ar: المنتج أو التغليف تالف
kk: Өнім немесе қаптама зақымдалған
zh: 产品或包装损坏

# reason_incomplete_set
source: Incomplete set
ar: مجموعة غير مكتملة
kk: Толық емес жинақ
zh: 配件不完整

# reason_unknown
source: Unknown reason
ar: سبب غير معروف
kk: Белгісіз себеп
zh: 未知原因

# are_you_sure_cancel_return
source: Are you sure you want to cancel the return? This action is irreversible.
ar: هل أنت متأكد أنك تريد إلغاء الإرجاع؟ هذا الإجراء لا يمكن التراجع عنه.
kk: Сіз қайтарымды жоюды қалайсыз ба? Бұл әрекет қайтарылмайды.
zh: 您确定要取消退货吗？此操作不可逆。

# confirm_cancel
source: Confirm cancellation
ar: تأكيد الإلغاء
kk: Жоюды растау
zh: 确认取消

# return_canceled_successfully
source: Return successfully canceled
ar: تم إلغاء الإرجاع بنجاح
kk: Қайтару сәтті жойылды
zh: 退货成功取消

source: Confirm return
ar: تأكيد الإرجاع
kk: Қайтарымды растау
zh: 确认退货

# are_you_sure_accept_return
source: Are you sure you want to accept the return?
ar: هل أنت متأكد أنك تريد قبول الإرجاع؟
kk: Сіз қайтарымды қабылдауға сенімдісіз бе?
zh: 您确定要接受退货吗？

# accept_return
source: Accept
ar: قبول
kk: Қабылдау
zh: 接受

source: Error accepting return
ar: حدث خطأ أثناء قبول الإرجاع
kk: Қайтарымды қабылдау кезінде қате пайда болды
zh: 接受退货时出错

# confirm_product_received
source: Confirm product receipt
ar: تأكيد استلام المنتج
kk: Өнім қабылданғанын растау
zh: 确认收到产品

# are_you_sure_accept_product
source: Confirm product receipt
ar: هل تؤكد استلام المنتج؟
kk: Сіз өнімді қабылдағаныңызды растайсыз ба?
zh: 确认收到产品

source: Accept
ar: قبول
kk: Қабылдау
zh: 接受

# no_order_data
source: No order data available
ar: لا توجد بيانات للطلب
kk: Тапсырыс туралы мәліметтер жоқ
zh: 没有订单数据

source: Error canceling return
ar: حدث خطأ أثناء إلغاء الإرجاع
kk: Қайтарымды жою кезінде қате орын алды
zh: 取消退货时出错

source: Product ID cannot be null
ar: لا يمكن أن يكون معرف المنتج فارغًا
kk: Өнім ID бос болмауы керек
zh: 产品ID不能为空

source: Pick up item
ar: استلام المنتج
kk: Тауарды алу
zh: 取货

source: Refund
ar: استرداد الأموال
kk: Қайтару
zh: 退款

source: Completed
ar: مكتمل
kk: Аяқталған
zh: 已完成

source: Add Warehouse
ar: إضافة مستودع
kk: Қойма қосу
zh: 添加仓库

source: Manager Data
ar: بيانات المدير
kk: Менеджер мәліметтері
zh: 经理信息

source: Enter warehouse name
ar: أدخل اسم المستودع
kk: Қойма атауын енгізіңіз
zh: 输入仓库名称

source: Create Warehouse
ar: إنشاء مستودع
kk: Қойманы құру
zh: 创建仓库

# your_warehouse
source: Your warehouses
ar: مستودعاتكم
kk: Сіздің қоймаларыңыз
zh: 您的仓库
