Repository: KaNa098w/bolshek_satu
Catalog: bolshek_pro/lib/l10n/intl_*.arb
Languages: ar, kk, zh

source: Support
ar: الدعم
kk: Қолдау
zh: 支持

# newUser
source: I'm a new user
ar: أنا مستخدم جديد
kk: Мен жаңа қолданушымын
zh: 我是新用户

# login
source: I already have an account. Log In
ar: لدي حساب بالفعل. تسجيل الدخول
kk: Менің аккаунтым бар. Кіру
zh: 我已有账号。登录

# agreementText
source: By using the application, you agree to the terms and
ar: باستخدام التطبيق، فإنك تقبل الشروط و
kk: Қолданбаны пайдалану арқылы сіз
zh: 使用应用即表示您同意条款和

source: privacy policy
ar: سياسة الخصوصية
kk: құпиялық саясатқа келісім бересіз
zh: 隐私政策

source: Registration
ar: التسجيل
kk: Тіркелу
zh: 注册

source: First Name
ar: الاسم الأول
kk: Аты
zh: 名

source: Last Name
ar: اسم العائلة
kk: Тегі
zh: 姓

source: Shop Name
ar: اسم المتجر
kk: Дүкен атауы
zh: 店铺名称

source: Categories
ar: الفئات
kk: Санаттар
zh: 类别

source: Choose category
ar: اختر التصنيف
kk: Санатты таңдаңыз
zh: 选择类别

source: Brands
ar: العلامات التجارية
kk: Брендтер
zh: 品牌

source: Choose brand
ar: اختر الماركة
kk: Брендті таңдаңыз
zh: 选择品牌

# phoneNumber
source: Enter your phone number
ar: أدخل رقم هاتفك
kk: Нөміріңізді енгізіңіз
zh: 输入您的电话号码

source: Address
ar: العنوان
kk: Мекенжай
zh: 地址

source: Register
ar: تسجيل
kk: Тіркелу
zh: 注册

source: Search category
ar: بحث عن فئة
kk: Санатты іздеу
zh: 搜索类别

# emptyCategoryList
source: Category list is empty
ar: قائمة الفئات فارغة
kk: Санаттар тізімі бос
zh: 类别列表为空

source: Confirm
ar: تأكيد
kk: Растау
zh: 确认

source: Search brand
ar: بحث عن علامة تجارية
kk: Брендті іздеу
zh: 搜索品牌

# emptyBrandList
source: Brand list is empty
ar: قائمة العلامات التجارية فارغة
kk: Брендтер тізімі бос
zh: 品牌列表为空

# phoneAlreadyRegistered
source: This phone number has already been registered
ar: هذا الرقم تم تسجيله بالفعل
kk: Мұндай нөмір бұрын тіркелген
zh: 该电话号码已注册

# errorLoadingCategories
source: Error loading categories: {error}
ar: خطأ في تحميل الفئات: {error}
kk: Санаттарды жүктеу қатесі: {error}
zh: 加载类别错误：{error}

# errorLoadingBrands
source: Error loading brands: {error}
ar: خطأ في تحميل العلامات التجارية: {error}
kk: Брендтерді жүктеу қатесі: {error}
zh: 加载品牌错误：{error}

source: Open map
ar: افتح الخريطة
kk: Картаны ашу
zh: 打开地图

# selectedCategories
source: Selected
ar: المحدد
kk: Таңдалды
zh: 已选择

# selectedBrands
source: Selected
ar: المحدد
kk: Таңдалды
zh: 已选择

source: OK
ar: موافق
kk: ОК
zh: 确定

# welcomeMessage
source: Welcome!
ar: مرحبا!
kk: Қош келдіңіз!
zh: 欢迎！

# phoneNotification
source: We use your phone number to send order notifications
ar: نستخدم رقم هاتفك لإرسال إشعارات الطلب
kk: Біз сіздің телефон нөміріңізді тапсырыс туралы хабарландырулар үшін пайдаланамыз
zh: 我们使用您的电话号码来发送订单通知

# enterPhone
source: Enter your phone number
ar: أدخل رقم هاتفك
kk: Телефон нөмірін енгізіңіз
zh: 请输入电话号码

# enterValidPhone
source: Enter a valid phone number
ar: أدخل رقم هاتف صحيح
kk: Дұрыс нөмір енгізіңіз
zh: 请输入有效的电话号码

source: Send SMS
ar: إرسال رسالة نصية
kk: SMS жіберу
zh: 发送短信

# numberNotRegistered
source: Your number is not registered.
ar: رقم هاتفك غير مسجل.
kk: Сіздің нөміріңіз тіркелмеген.
zh: 您的号码尚未注册。

# registrationPrompt
source: Please proceed to the registration page.
ar: يرجى الانتقال إلى صفحة التسجيل.
kk: Өтінеміз, тіркеу бетіне өтіңіз.
zh: 请前往 注册页面。

source: Go to Register
ar: الانتقال
kk: Тіркеуге өту
zh: 前往注册

# smsSentMessageSuccess
source: SMS code sent successfully
ar: تم إرسال رمز SMS بنجاح
kk: SMS-код сәтті жіберілді
zh: 短信验证码已成功发送

# smsSentMessageError
source: Error sending SMS: {error}
ar: خطأ في إرسال SMS: {error}
kk: SMS жіберу қатесі: {error}
zh: 发送短信错误: {error}

# smsCodeInputTitle
source: Enter SMS code
ar: أدخل رمز SMS
kk: SMS-кодты енгізіңіз
zh: 请输入短信验证码

source: Phone confirmation
ar: تأكيد الهاتف
kk: Нөмірді растау
zh: 号码确认

# smsSentText
source: We have sent a code to your phone number.
ar: لقد أرسلنا رمزًا إلى رقم هاتفك.
kk: Біз сіздің нөміріңізге код жібердік.
zh: 我们已向您的电话号码发送了验证码。

# verifyButtonText
source: Verify
ar: تحقق
kk: Растау
zh: 验证

# resendTimerText
source: Resend code in {seconds} sec.
ar: أعد الإرسال خلال {seconds} ثانية
kk: {seconds} секнен кейін қайта жіберіңіз
zh: {seconds}秒后可重新发送

# resendText
source: Resend code
ar: إعادة إرسال الرمز
kk: Кодты қайта жіберу
zh: 重新发送验证码

# registerError
source: Registration error: {error}
ar: خطأ في التسجيل: {error}
kk: Тіркеу қатесі: {error}
zh: 注册错误: {error}

# accountNotActive
source: Your account is not active yet. Please wait for a manager's response.
ar: حسابك غير نشط بعد. يرجى انتظار رد المدير.
kk: Сіздің аккаунтыңыз әлі белсендірілмеген. Менеджердің жауабын күтіңіз.
zh: 您的账户尚未激活。请等待管理员回复。

# invalidOtp
source: Incorrect SMS code. Please try again.
ar: رمز SMS غير صحيح. حاول مرة أخرى.
kk: Қате SMS-код. Қайтадан көріңіз.
zh: 短信验证码错误，请重试。

# otpExpired
source: Too many attempts. Please try again later.
ar: عدد المحاولات كثيرة. حاول مرة أخرى لاحقاً.
kk: Көптеген әрекеттер. Кейінірек көріңіз.
zh: 尝试次数过多，请稍后再试。

source: Enter SMS Code
ar: أدخل رمز الرسائل القصيرة
kk: SMS кодын енгізіңіз
zh: 输入短信验证码

# number_confirmation
source: Number Verification
ar: تأكيد الرقم
kk: Нөмірді растау
zh: 号码确认

# sent_code_message
source: We have sent the code to {phoneNumber}.
ar: لقد أرسلنا الرمز إلى الرقم {phoneNumber}.
kk: Біз {phoneNumber} нөміріне код жібердік.
zh: 我们已向号码 {phoneNumber} 发送验证码。

# registration_sent
source: Your registration request has been sent!
ar: تم إرسال طلب التسجيل الخاص بك!
kk: Тіркелу сұрауыңыз жіберілді!
zh: 您的注册请求已发送！

# please_wait_manager
source: Please wait for a manager's response.
ar: يرجى انتظار رد المدير.
kk: Менеджердің жауабын күтіңіз.
zh: 请等待经理的回复。

source: Resend Code
ar: أعد إرسال الرمز
kk: Кодты қайта жіберу
zh: 重新发送验证码

# resend_timer
source: Resend in {seconds} sec.
ar: إعادة الإرسال بعد {seconds} ثانية
kk: {seconds} секундтан кейін қайта жіберу
zh: 在 {seconds} 秒后重新发送

source: Settings
ar: الإعدادات
kk: Баптаулар
zh: 设置

source: Goods
ar: السلع
kk: Тауарлар
zh: 商品

source: Orders
ar: الطلبات
kk: Тапсырыстар
zh: 订单

source: Home
ar: الرئيسية
kk: Басты бет
zh: 首页

source: Phone
ar: الهاتف
kk: Телефон
zh: 电话

# selected_address
source: Address not selected
ar: العنوان غير مُحدد
kk: Мекенжай таңдалмады
zh: 地址未选择

# selected_country
source: Country unknown
ar: الدولة غير معروفة
kk: Ел белгісіз
zh: 国家未知

# selected_city
source: City unknown
ar: المدينة غير معروفة
kk: Қала белгісіз
zh: 城市未知

source: Choose language
ar: اختر اللغة
kk: Таңдалған тіл
zh: 选择语言

source: Change language
ar: تغيير اللغة
kk: Тілді өзгерту
zh: 切换语言

# add_manager_title
source: Fill in the details to add a manager
ar: املأ البيانات لإضافة مدير
kk: Басқарушыны қосу үшін деректерді толтырыңыз
zh: 填写信息 以添加经理

source: First Name
ar: الاسم الأول
kk: Аты
zh: 名字

source: Last Name
ar: اسم العائلة
kk: Тегі
zh: 姓氏

# enter_phone
source: Enter phone number
ar: أدخل رقم الهاتف
kk: Телефон нөмірін енгізіңіз
zh: 输入电话号码

source: Add
ar: إضافة
kk: Қосу
zh: 添加

# edit_manager_title
source: Manager Details
ar: بيانات المدير
kk: Басқарушы мәліметтері
zh: 经理信息

source: Number
ar: الرقم
kk: Нөмір
zh: 号码

source: Edit
ar: تعديل
kk: Өзгерту
zh: 编辑

# logout_title
source: Logout
ar: تسجيل الخروج
kk: Шығу
zh: 退出账户

# logout_confirmation
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
kk: Шығуды қалайтыныңызға сенімдісіз бе?
zh: 您确定要退出吗？

# logout_button
source: Logout
ar: تسجيل الخروج
kk: Шығу
zh: 退出账户

# delete_manager_title
source: Delete Confirmation
ar: تأكيد الحذف
kk: Жоюды растау
zh: 删除确认

# delete_manager_confirmation
source: Are you sure you want to delete this manager?
ar: هل أنت متأكد أنك تريد حذف هذا المدير؟
kk: Бұл басқарушыны жоюға сенімдісіз бе?
zh: 您确定要删除该经理吗？

source: Delete
ar: حذف
kk: Жою
zh: 删除

source: Cancel
ar: إلغاء
kk: Бас тарту
zh: 取消

# delete_address_title
source: Delete Address
ar: حذف العنوان
kk: Мекенжайды жою
zh: 删除地址

# delete_address_confirmation
source: Are you sure you want to delete this address?
ar: هل أنت متأكد أنك تريد حذف هذا العنوان؟
kk: Бұл мекенжайды жоюға сенімдісіз бе?
zh: 您确定要删除该地址吗？

# org_name_label
source: Organization Name:
ar: اسم المنظمة:
kk: Ұйым атауы:
zh: 组织名称:

# owner_label
source: Owner:
ar: المالك:
kk: Меншік иесі:
zh: 所有者:

# phone_label
source: Phone Number
ar: رقم الهاتف
kk: Телефон нөмірі
zh: 电话号码

# org_address_label
source: Organization Address:
ar: عنوان المنظمة:
kk: Ұйым мекенжайы:
zh: 组织地址:

# city_label
source: City:
ar: المدينة:
kk: Қала:
zh: 城市:

# address_label
source: Address:
ar: العنوان:
kk: Мекенжай:
zh: 地址:

source: Add Address
ar: إضافة عنوان
kk: Мекенжай қосу
zh: 添加地址

# manager_org_title
source: Organization Manager:
ar: مدير المنظمة:
kk: Ұйым басқарушысы:
zh: 组织经理:

source: unknown
ar: غير معروف
kk: белгісіз
zh: 未知

# manager_phone
source: Phone:
ar: الهاتف:
kk: Телефон:
zh: 电话:

# status_label
source: Status:
ar: الحالة:
kk: Күй:
zh: 状态:

source: Active
ar: نشط
kk: Белсенді
zh: 激活的

source: Inactive
ar: غير نشط
kk: Белсенді емес
zh: 不活跃

source: No managers found
ar: لم يتم العثور على مدراء
kk: Басқарушылар табылмады
zh: 未找到经理

# no_managers
source: You have no managers
ar: ليس لديك مدراء
kk: Сіздің басқарушыларыңыз жоқ
zh: 您没有经理

# address_added
source: Address added successfully
ar: تم إضافة العنوان بنجاح
kk: Мекенжай сәтті қосылды
zh: 地址添加成功

# address_add_error
source: Error adding address
ar: خطأ أثناء إضافة العنوان
kk: Мекенжай қосу кезінде қате
zh: 添加地址时出错

# address_deleted
source: Address deleted successfully
ar: تم حذف العنوان بنجاح
kk: Мекенжай сәтті жойылды
zh: 地址删除成功

# manager_added
source: Manager added successfully
ar: تم إضافة المدير بنجاح
kk: Басқарушы сәтті қосылды
zh: 经理添加成功

# fields_empty
source: Please fill in all fields
ar: يرجى ملء جميع الحقول
kk: Барлық өрістерді толтырыңыз
zh: 请填写所有字段

# manager_edited
source: Manager updated successfully
ar: تم تحديث بيانات المدير بنجاح
kk: Басқарушы сәтті өзгертілді
zh: 经理信息更新成功

# manager_deleted
source: Manager deleted successfully
ar: تم حذف المدير بنجاح
kk: Басқарушы сәтті жойылды
zh: 经理删除成功

# manager_delete_error
source: Failed to delete manager
ar: فشل في حذف المدير
kk: Басқарушыны жою мүмкін болмады
zh: 删除经理失败

# org_info_missing
source: Organization information is missing
ar: معلومات المؤسسة مفقودة
kk: Ұйым туралы ақпарат жоқ
zh: 缺少组织信息

# no_org_data
source: No organization data
ar: لا توجد بيانات عن المؤسسة
kk: Ұйым туралы мәліметтер жоқ
zh: 没有组织数据

# address_load_error
source: Error loading address
ar: خطأ في تحميل العنوان
kk: Мекенжайды жүктеуде қате
zh: 加载地址错误

# manager_load_error
source: Error loading manager
ar: خطأ في تحميل المدير
kk: Басқарушыны жүктеуде қате
zh: 加载经理错误

# orders_header
source: Orders
ar: الطلبات
kk: Тапсырыстар
zh: 订单

source: New Orders
ar: طلبات جديدة
kk: Жаңа тапсырыстар
zh: 新订单

source: Processing Orders
ar: قيد المعالجة
kk: Өңделуде
zh: 处理中订单

source: Delivered Orders
ar: طلبات مُسلمة
kk: Жеткізілген тапсырыстар
zh: 已交付订单

source: Cancelled Orders
ar: الطلبات الملغاة
kk: Бас тартылған тапсырыстар
zh: 已取消订单

# goods_header
source: Products
ar: المنتجات
kk: Өнімдер
zh: 产品

# active_goods
source: Active Products
ar: المنتجات المتاحة
kk: Сатылымдағы өнімдер
zh: 在售产品

# inactive_goods
source: Inactive Products
ar: المنتجات غير المعروضة
kk: Сатылымнан алынған өнімдер
zh: 下架产品

# waiting_goods
source: Awaiting
ar: في الانتظار
kk: Күтуде
zh: 待处理

# returns_header
source: Returns
ar: المرتجعات
kk: Қайтарымдар
zh: 退货

# new_returns
source: Return Requests
ar: طلبات الإرجاع
kk: Жаңа қайтарымдар
zh: 退货申请

# completed_returns
source: Closed Return Requests
ar: طلبات الإرجاع المكتملة
kk: Аяқталған қайтарымдар
zh: 已完成退货

# add_first_product
source: Add your first product
ar: أضف أول منتج لك
kk: Бірінші өніміңізді қосыңыз
zh: 添加您的第一个产品

source: Open chat with Bolshek
ar: افتح الدردشة مع بولشيك
kk: Bolshek-пен чат ашу
zh: 与 Bolshek 聊天

# whatsapp_launch_error
source: Failed to open WhatsApp
ar: فشل في فتح واتساب
kk: WhatsApp-ты ашу сәтсіз аяқталды
zh: 无法打开 WhatsApp

# bottom_nav_home
source: Home
ar: الرئيسية
kk: Басты бет
zh: 首页

# bottom_nav_orders
source: Orders
ar: الطلبات
kk: Тапсырыстар
zh: 订单

# bottom_nav_goods
source: Products
ar: المنتجات
kk: Өнімдер
zh: 产品

# bottom_nav_settings
source: Settings
ar: الإعدادات
kk: Баптаулар
zh: 设置

# no_address_found
source: No addresses found
ar: لم يتم العثور على عناوين
kk: Мекенжайлар табылмады
zh: 未找到地址

# empty_state_description
source: And start selling at the Store on Bolshek.kz
ar: وابدأ البيع في المتجر على Bolshek.kz
kk: Және Bolshek.kz-дегі дүкенде сатуды бастаңыз
zh: 并开始在 Bolshek.kz 商店销售

# orders_tab_new
source: New
ar: جديد
kk: Жаңа
zh: 新的

# orders_tab_paid
source: Paid
ar: مدفوع
kk: Төленген
zh: 已付款

# orders_tab_processing
source: Processing
ar: قيد المعالجة
kk: Өңделуде
zh: 处理中

# orders_tab_delivered
source: Delivered
ar: تم التوصيل
kk: Жеткізілген
zh: 已送达

# orders_tab_cancelled
source: Cancelled
ar: ملغي
kk: Бас тартылған
zh: 已取消

# goods_tab_active
source: Active
ar: متوفرة
kk: Сатылымда
zh: 在售

# goods_tab_awaiting
source: Awaiting
ar: في الانتظار
kk: Күтуде
zh: 等待中

# goods_tab_inactive
source: Inactive
ar: غير نشطة
kk: Белсендірілмеген
zh: 未激活

# change_price_dialog_title
source: Change Price
ar: تغيير السعر
kk: Бағаны өзгерту
zh: 修改价格

# enter_new_price_hint
source: Enter new price
ar: أدخل سعرًا جديدًا
kk: Жаңа бағаны енгізіңіз
zh: 输入新价格

source: Save
ar: حفظ
kk: Сақтау
zh: 保存

# price_update_success
source: Price updated successfully
ar: تم تحديث السعر بنجاح
kk: Баға сәтті жаңартылды
zh: 价格更新成功

source: Load error:
ar: خطأ في التحميل:
kk: Жүктеу қателігі:
zh: 加载错误：

# no_price_variants
source: No price variants available for the product
ar: لا توجد خيارات سعر لهذا المنتج
kk: Өнімде баға варианты жоқ
zh: 该商品没有价格选项

# no_products_message
source: There are no products in this section
ar: لا توجد منتجات في هذا القسم
kk: Осы бөлімде өнімдер жоқ
zh: 本部分没有商品

source: View Product
ar: عرض المنتج
kk: Өнімді қарау
zh: 查看商品

source: Change price
ar: تغيير السعر
kk: Бағаны өзгерту
zh: 更改价格

source: Edit Product
ar: تعديل المنتج
kk: Өнімді өңдеу
zh: 编辑商品

source: No name
ar: بدون اسم
kk: Атауы жоқ
zh: 无名称

source: Price not specified
ar: السعر غير محدد
kk: Бағасы көрсетілмеген
zh: 未指定价格

# add_new_good
source: Add new product
ar: أضف منتجًا جديدًا
kk: Жаңа өнімді қосу
zh: 添加新商品

# no_orders_message
source: There are no orders in this section
ar: لا توجد طلبات في هذا القسم
kk: Бұл бөлімде тапсырыстар жоқ
zh: 本部分没有订单

source: Invalid date
ar: تاريخ غير صالح
kk: Жарамсыз күн
zh: 无效日期

source: Address not specified
ar: العنوان غير محدد
kk: Мекенжай көрсетілмеген
zh: 未指定地址

# unknown_order
source: Unknown
ar: غير معروف
kk: Белгісіз
zh: 未知

source: Date not specified
ar: التاريخ غير محدد
kk: Күн көрсетілмеген
zh: 未指定日期

# additional_items
source: more items
ar: عناصر إضافية
kk: басқа заттар
zh: 件其他商品

# address_prefix
source: Address:
ar: العنوان:
kk: Мекенжай:
zh: 地址：

# status_prefix
source: Status:
ar: الحالة:
kk: Мәртебе:
zh: 状态:

# date_prefix
source: Date:
ar: التاريخ:
kk: Күн:
zh: 日期：

source: Order Details
ar: تفاصيل الطلب
kk: Тапсырыс мәліметтері
zh: 订单详情

# order_prefix
source: Order â„–
ar: طلب رقم
kk: Тапсырыс №
zh: 订单号

# error_prefix
source: Error:
ar: خطأ:
kk: Қате:
zh: 错误:

source: Order data not found
ar: بيانات الطلب غير موجودة
kk: Тапсырыс туралы деректер табылмады
zh: 未找到订单数据

source: Order Composition
ar: مكونات الطلب
kk: Тапсырыс құрамы
zh: 订单组成

# order_empty
source: No items in the order
ar: لا توجد عناصر في الطلب
kk: Тапсырыста өнімдер жоқ
zh: 订单中没有商品

source: Total amount
ar: المبلغ الإجمالي
kk: Жалпы сома
zh: 总金额

# delivery_amount
source: Delivery Fee
ar: رسوم التوصيل
kk: Жеткізу ақысы
zh: 运费

source: Final Amount
ar: المجموع النهائي
kk: Соңғы сома
zh: 最终金额

source: Order Date
ar: تاريخ الطلب
kk: Тапсырыс күні
zh: 下单日期

source: Buyer
ar: المشتري
kk: Сатып алушы
zh: 买家

source: Transactions
ar: المعاملات
kk: Транзакциялар
zh: 交易

source: Cashless Payment
ar: الدفع غير النقدي
kk: Бейнесалма төлем
zh: 非现金支付

# cash_payment
source: Cash
ar: دفع نقدي
kk: Нақтыланған төлем
zh: 现金

source: Not specified
ar: غير محدد
kk: Көрсетілмеген
zh: 未指定

source: Cannot launch
ar: تعذر التشغيل
kk: Іске қосу мүмкін емес
zh: 无法启动

source: Status update error:
ar: خطأ تحديث الحالة:
kk: Мәртебені жаңарту қатесі:
zh: 状态更新错误:

source: Confirm action
ar: تأكيد الإجراء
kk: Әрекетті растау
zh: 确认操作

# cancel_item_confirmation
source: Are you sure you want to cancel the item? This action is irreversible.
ar: هل أنت متأكد من أنك تريد إلغاء هذا العنصر؟ هذا الإجراء غير قابل للتراجع.
kk: Өнімді болдырмауды қалайсыз ба? Бұл әрекет кері қайтарылмайды.
zh: 您确定要取消该商品吗？此操作不可撤销。

# cancel_action
source: Cancel
ar: إلغاء
kk: Болдырмау
zh: 取消

# item_cancel_success
source: Item canceled successfully
ar: تم إلغاء العنصر بنجاح
kk: Өнім сәтті болдырылды
zh: 商品取消成功

# item_id_null_error
source: Item ID cannot be null
ar: معرّف العنصر لا يمكن أن يكون فارغاً
kk: Өнім ID мәні бос болмауы керек
zh: 商品 ID 不能为空

# cancel_item_error
source: Item cancellation error:
ar: خطأ إلغاء العنصر:
kk: Өнімді болдырмау қатесі:
zh: 商品取消错误:

source: Select new status
ar: اختر حالة جديدة
kk: Жаңа мәртебені таңдаңыз
zh: 选择新状态

# price_prefix
source: Price:
ar: السعر:
kk: Баға:
zh: 价格:

source: Change item status
ar: تغيير حالة العنصر
kk: Өнім мәртебесін өзгерту
zh: 更改商品状态

source: Cancel item
ar: إلغاء العنصر
kk: Өнімді болдырмау
zh: 取消商品

# order_status_new
source: New
ar: جديد
kk: Жаңа

# order_status_awaiting_payment
source: Awaiting Payment
ar: في انتظار الدفع
kk: Төлемді күту
zh: 等待付款

# order_status_paid
source: Paid
ar: مدفوع
kk: Төленген
zh: 已付款

# order_status_awaiting_confirmation
source: Awaiting Confirmation
ar: في انتظار التأكيد
kk: Растау күтілуде
zh: 等待确认

# order_status_processing
source: Processing
ar: قيد المعالجة
kk: Өңделуде
zh: 处理中

# order_status_created
source: Created
ar: تم الإنشاء
kk: Жасаған
zh: 已创建

# order_status_partially_delivered
source: Partially Delivered
ar: تم التوصيل جزئيًا
kk: Жартылай жеткізілді
zh: 部分已送达

# order_status_delivered
source: Delivered
ar: تم التوصيل
kk: Жеткізілді
zh: 已送达

# order_status_completed
source: Completed
ar: مكتمل
kk: Аяқталды
zh: 已完成

# order_status_partially_cancelled
source: Partially Cancelled
ar: تم الإلغاء جزئيًا
kk: Жартылай болдырылмаған
zh: 部分取消

# order_status_partially_returned
source: Partially Returned
ar: تم الإرجاع جزئيًا
kk: Жартылай қайтарылды
zh: 部分退货

# order_status_returned
source: Returned
ar: تم الإرجاع
kk: Қайтарылды
zh: 已退货

# order_status_cancelled
source: Cancelled
ar: ملغي
kk: Болдырылмаған
zh: 已取消

# order_status_shipped
source: Shipped
ar: تم الشحن
kk: Жіберілді
zh: 已发货

# order_status_rejected
source: Cancelled by Seller
ar: ملغي من قبل البائع
kk: Сатушы тарапынан бас тартылды
zh: 卖家取消

# order_status_awaiting_pick_up
source: Awaiting Pick Up
ar: في انتظار الاستلام
kk: Алу күтілуде
zh: 等待取货

# order_status_awaiting_refund
source: Awaiting Refund
ar: في انتظار استرداد الأموال
kk: Ақшаны қайтаруды күту
zh: 等待退款

# product_name_absent
source: Product name is missing
ar: اسم المنتج مفقود
kk: Өнімнің атауы жоқ
zh: 名称缺失

# product_description_absent
source: Product description is missing
ar: وصف المنتج مفقود
kk: Өнімнің сипаттамасы жоқ
zh: 描述缺失

source: No available image
ar: لا توجد صورة متاحة
kk: Қол жетімді сурет жоқ
zh: 没有可用的图片

# price_absent
source: Price not available
ar: السعر غير متوفر
kk: Баға көрсетілмеген
zh: 价格缺失

source: Product amount
ar: مبلغ المنتج
kk: Өнім сомасы
zh: 商品金额

source: Enter new price
ar: أدخل السعر الجديد
kk: Жаңа бағаны енгізіңіз
zh: 输入新价格

source: Discount percent
ar: نسبة الخصم
kk: Жеңілдік пайызы
zh: 折扣百分比

source: Enter discount percent
ar: أدخل نسبة الخصم
kk: Жеңілдік пайызын енгізіңіз
zh: 输入折扣百分比

source: Discount amount
ar: مبلغ الخصم
kk: Жеңілдік сомасы
zh: 折扣金额

# price_updated
source: Price updated successfully
ar: تم تحديث السعر بنجاح
kk: Баға сәтті жаңартылды
zh: 价格更新成功

source: Error
ar: خطأ
kk: Қате
zh: 错误

source: Description
ar: الوصف
kk: Сипаттама
zh: 描述

# description_absent
source: Description is missing
ar: الوصف غير متوفر
kk: Сипаттама жоқ
zh: 缺少描述

# characteristic_title_absent
source: Title missing
ar: العنوان مفقود
kk: Атау жоқ
zh: 标题缺失

# characteristic_value_absent
source: Value missing
ar: القيمة مفقودة
kk: Мән жоқ
zh: 数值缺失

source: Product code
ar: رمز المنتج
kk: Өнім коды
zh: 商品编码

source: Manufacturer
ar: المُصنّع
kk: Өндіруші
zh: 制造商

source: Characteristics
ar: المواصفات
kk: Сипаттамалар
zh: 规格

source: Publish
ar: نشر
kk: Жариялау
zh: 发布

# from_sale
source: Remove from sale
ar: إزالة من البيع
kk: Сатылымнан шығару
zh: 下架

# change_product
source: Edit product
ar: تعديل المنتج
kk: Өнімді өзгерту
zh: 编辑商品

source: Confirmation
ar: تأكيد
kk: Растау
zh: 确认

# publish_confirmation
source: Are you sure you want to publish the product?
ar: هل أنت متأكد أنك تريد نشر المنتج؟
kk: Өнімді жариялауды растаңыз?
zh: 您确定要发布该商品吗？

# remove_sale_confirmation
source: Are you sure you want to remove the product from sale?
ar: هل أنت متأكد أنك تريد إزالة المنتج من البيع؟
kk: Өнімді сатылымнан шығарғыңыз келе ме?
zh: 您确定要下架该商品吗？

# product_published
source: Product submitted for publication
ar: تم إرسال المنتج للنشر
kk: Өнім жариялауға жіберілді
zh: 商品已提交发布

# product_removed
source: Product removed from sale
ar: تم إزالة المنتج من البيع
kk: Өнім сатылымнан шығарылды
zh: 商品已下架

source: Original
ar: أصلي
kk: Оригинал
zh: 原装

source: Sub-original
ar: فرعي
kk: Суб-оригинал
zh: 副原装

source: Auto disassembly
ar: تفكيك تلقائي
kk: Авторазбор
zh: 自动拆解

# unknown_variant
source: Unknown
ar: غير معروف
kk: Белгісіз
zh: 未知

source: Article
ar: رمز المنتج
kk: Артикул
zh: 货号

# tag_default
source: Tag
ar: علامة
kk: Тег
zh: 标签

source: Enter product name
ar: أدخل اسم المنتج
kk: Өнімнің атауын енгізіңіз
zh: 请输入产品名称

# not_found_add_yourself
source: Didn't find your product? Add it yourself
ar: لم تجد منتجك؟ أضفه بنفسك
kk: Сіздің өніміңіз табылмады ма? Өз бетіңізше қосыңыз
zh: 未找到您的产品？自己添加

source: Choose
ar: اختيار
kk: Таңдау
zh: 选择

# upload_photos
source: Upload 1 to 5 photos
ar: قم بتحميل من 1 إلى 5 صور
kk: 1-ден 5-ке дейін фото жүктеңіз
zh: 上传1到5张照片

source: Product Name
ar: اسم المنتج
kk: Өнім атауы
zh: 商品名称

source: Brand
ar: العلامة التجارية
kk: Бренд
zh: 品牌

source: Category
ar: التصنيف
kk: Санат
zh: 类别

source: Price
ar: السعر
kk: Баға
zh: 价格

source: Enter price
ar: أدخل السعر
kk: Бағаны енгізіңіз
zh: 请输入价格

# continue_text
source: Continue
ar: استمرار
kk: Жалғастыру
zh: 继续

# enter_valid_price
source: Please enter a valid price.
ar: يرجى إدخال سعر صحيح.
kk: Дұрыс бағаны енгізіңіз.
zh: 请输入正确的价格。

# fill_required_fields
source: Please fill in all required fields before continuing.
ar: يرجى ملء جميع الحقول المطلوبة قبل المتابعة.
kk: Жалғастыру үшін барлық міндетті өрістерді толтырыңыз.
zh: 请填写所有必填字段再继续。

# choose_brand
source: Choose a brand
ar: اختر العلامة التجارية
kk: Бренд таңдаңыз
zh: 选择品牌

# choose_category
source: Choose a category
ar: اختر الفئة
kk: Санатты таңдаңыз
zh: 选择分类

# categories_empty
source: The category list is empty
ar: قائمة الفئات فارغة
kk: Санаттар тізімі бос
zh: 分类列表为空

# category_search
source: Search category
ar: بحث الفئة
kk: Санатты іздеу
zh: 搜索分类

# brand_search
source: Search brand
ar: بحث العلامة التجارية
kk: Бренд іздеу
zh: 搜索品牌

source: No brands
ar: لا توجد علامات تجارية
kk: Брендтер жоқ
zh: 没有品牌

# create_your_brand
source: Create your own brand
ar: أنشئ علامتك التجارية الخاصة
kk: Өзіңіздің брендіңізді жасаңыз
zh: 创建您自己的品牌

source: Add brand
ar: إضافة علامة تجارية
kk: Бренд қосу
zh: 添加品牌

source: Enter brand name
ar: أدخل اسم العلامة التجارية
kk: Бренд атауын енгізіңіз
zh: 请输入品牌名称

source: Error loading categories
ar: خطأ في تحميل الفئات
kk: Санаттарды жүктеу қатесі
zh: 加载分类错误

source: Error loading brands
ar: خطأ في تحميل العلامات التجارية
kk: Брендтерді жүктеу қатесі
zh: 加载品牌错误

# image_compress_error
source: Failed to compress image
ar: فشل في ضغط الصورة
kk: Суретті сығу сәтсіз аяқталды
zh: 图片压缩失败
